r4d10n/hx-esp32-cam-fpv/esp32-gs-usb-test/sdkconfig.defaults
# USB NCM Test - SDK Configuration

# Target ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# CRITICAL: Disable USB Serial/JTAG to free GPIO19/20 for USB OTG
# Use UART0 for console instead (connect external USB-UART adapter for logs)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# USB OTG/TinyUSB NCM configuration
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_NET_MODE_NCM=y
CONFIG_TINYUSB_NET_ENABLED=y
CONFIG_TINYUSB_DESC_CUSTOM_VID=0x303A
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4002
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="ESP32-Test"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="USB NCM Test"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# PSRAM disabled
CONFIG_SPIRAM=n

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
CONFIG_HTTPD_MAX_URI_LEN=512

# LWIP
CONFIG_LWIP_NETIF_LOOPBACK=y
